Repository: shreyashe-coder/lingo.dev
Catalog: packages/cli/demo/xcode-xcstrings-v2/complex-example.xcstrings
Source language: en
Languages: es, ja, ru

# plural_comments_thread
source: View all %d comments
es: Ver todos los %d comentarios
ja: %d 件のコメントを表示
ru: Просмотреть %d комментария

# plural_complex_sentence
source: %@ uploaded %d files today
es: %@ ha subido %d archivos hoy
ja: %@は今日%d 個のファイルをアップロードしました
ru: %@ загрузил %d файла сегодня

# plural_download_speed
source: Downloading %d files at %.1f MB/s
es: Descargando %d archivos a %.1f MB/s
ja: %d個のファイルを%.1f MB/sでダウンロード中
ru: Загрузка %d файлов со скоростью %.1f МБ/с

# plural_likes_with_names
source: %@ and %d others like this
es: A %@ y a %d más les gusta esto
ja: %@と他%d 人がいいねしました
ru: %@ и еще %d человекам это нравится

# plural_mixed_types
source: %@ purchased %d items for $%.2f
es: %@ compró %d artículos por $%.2f
ja: %@は%d個のアイテムを$%.2fで購入しました
ru: %@ купил %d товара за $%.2f

# plural_participants
source: %@ and %d others are participating
es: %@ y %d más están participando
ja: %@と他%d 人が参加しています
ru: %@ и еще %d человека участвуют

# plural_positional_args
source: %1$@ has %2$d followers in %3$@
es: %1$@ tiene %2$d seguidores en %3$@
ja: %1$@は%3$@で%2$d 人のフォロワーがいます
ru: %1$@ имеет %2$d подписчика в %3$@

# plural_storage_usage
source: %.2f GB used of %.2f GB
es: %.2f GB usados de %.2f GB
ja: %.2f GBを%.2f GB中使用中
ru: %.2f ГБ использовано из %.2f ГБ

# plural_time_remaining
source: %d minutes remaining
es: %d minutos restantes
ja: 残り%d 分
ru: Осталось %d минуты

# plural_unread_notifications
source: %d new notifications
es: %@ nuevas notificaciones
ja: %@件の新しい通知
ru: %lld новых уведомления от %@

# plural_with_float
source: %.1f miles
es: %.1f millas
ja: %.1f マイル
ru: %.1f мили

# plural_with_high_precision
source: %.2f kilometers
es: %.2f kilómetros
ja: %.2f キロメートル
ru: %.2f километра

# plural_with_one_variable
source: %@ has %d photos
es: %@ tiene %d fotos
ja: %@は%d 枚の写真を持っています
ru: %@ имеет %d фотографии

# plural_with_percentage
source: %d files uploaded (%.0f%% complete)
es: %d archivos subidos (%.0f%% completado)
ja: %d個のファイルがアップロードされました（%.0f%%完了）
ru: %d файла загружено (%.0f%% завершено)

# plural_with_two_variables
source: %@ uploaded %d photos to %@
es: %@ subió %d fotos a %@
ja: %@は%d 枚の写真を%@にアップロードしました
ru: %@ загрузил %d фотографии в %@

# plural_with_units
source: %d files (%.1f MB total)
es: %d archivos (%.1f MB en total)
ja: %d個のファイル（合計%.1f MB）
ru: %d файла (%.1f МБ всего)

# plural_with_zero
source: %d messages
es: %d mensajes
ja: %d 件のメッセージ
ru: %d сообщения

# simple_plural
source: %d items
es: %d elementos
ja: %d アイテム
ru: %d предмета

# simple_string
source: Welcome to the app
es: Bienvenido a la aplicación
ja: アプリへようこそ
ru: Добро пожаловать в приложение

# plural_with_long_long
source: %lld bytes
ja: %lld バイト
ru: %lld байта
